const messages = {
  menu: {
    home: 'Главное',
    pricing: 'Уроки',
    aboutUs: 'О нас',
    blog: 'Блог',
    testimonials: 'Отзывы',
    faq: 'FAQ',
    contact: 'Контакт'
  },
  general: {
    speakEnglish: 'Вот, где нужно учить английский!',
    introText:
      'Нами создана эта программа именно для вас. Она поможет вам легко и качественно выучить английский. Программа опирается на многолетний опыт преподавания языка такого большого профессионала как <a href="https://ru.wikipedia.org/wiki/%D0%97%D0%B0%D0%B3%D0%BB%D0%B0%D0%B2%D0%BD%D0%B0%D1%8F_%D1%81%D1%82%D1%80%D0%B0%D0%BD%D0%B8%D1%86%D0%B0">Нугзар Б. Рухадзе</a>.',
    learnMore: 'Узнайте больше',
    getStarted: 'Начните',
    ourPricing: 'Наши цены',
    popularCourses: 'Описание первого курса',
    getSalesAndOffers: 'Уценки и предложения',
    subscribeforNewsletter: 'Подпишитесь на рассылку новостей',
    subscribe: 'Подписаться',
    emailAddress: 'Адрес электронной почты:',
    copyright: 'Copyright © 2020 NBR.ge. Все права защищены',
    close: 'Закрыть',
    signIn: 'Войти',
    signUp: 'Регистрация',
    registration: 'Регистрация',
    or: 'Или',
    submit: 'Отправить',
    peopleAboutUs: 'Люди о нас',
    testimonials: 'Отзывы',
    aboutUs: 'О нас',
    ourTeam: 'Наша команда',
    ourBlog: 'Наш блог',
    connect: 'Связаться',
    withUs: 'С нами',
    askUsA: 'Задайте нам вопрос',
    question: 'Вопрос',
    correct: 'верен',
    incorrect: 'неверен',
    watch: 'смотреть',
    promoVideo: 'Промо видео'
  },
  pricing: {
    summary: `После завершения первого курса, вы сможете общаться по-английски на начальном уровне в каждодневных ситуациях дома, на работе, на улице, в магазине, в поездках и т.д. и все это будет происходить в простом настоящем времени. <br>
    Таким образом, вы уже студент первого курса, и ми хотим вам сказать, что весь курс состоит из 5 частей и содержит 44 урока.
`
  },
  course: {
    bestChoice: 'Лучший выбор',
    playDemo: 'Включить промо',
    buyNow: 'Купите сейчас',
    includesLessons: '{count} уроки',
    learnMore: 'Узнайте больше',
    buyCourseNow: 'Купите сейчас',
    noTimelines: 'В этом уроке нет содержания'
  },
  companyIntro: {
    about: 'О нас',
    company: 'Наша миссия',
    introText: `Сферой деятельности NBR является обучение английскому языку с самого начального уровня вплоть до практического использования языка. Мы создали самоучитель беспрецедентно качества для носителей грузинского языка, который  дает возможность людям разных возрастов, профессий и интересов, преодолеть все трудности, связанные  с изучением английского, и овладеть языком эффективно за короткое время и,  находясь в любой части мира, учитывая, что английский является универсальным языком глобальной коммуникации в сегодняшнем мире.`,
    lessonsTitle: 'История создания программы',
    lessonsCreateHistory: `Идея создания программы была зарождена, когда Мая Мчедлидзе  обратилась к Нугзару Б. Рухадзе  с намерением расширить свои знания английского языка. В последовавшем академическом процессе стало очевидно, что многое, что Мая учила ранее, требовало дальнейшего пояснения. В результате многолетних совместных усилий, ученик и учитель решили вместе создать программу, учитывающую их опыт. Таким образом, множество трудностей, перенесенных учеником в процессе изучения языка и опыт учителя, накопленный во время работы с огромным количеством учеников, были использованы как основание этих уроков. И вот, результат перед нами: уникальный метод обучения английскому языку, отличающийся от любых других аналогичных программ, который опирается на этом двойном опыте. Ученик и учитель до сих пор продолжают плодотворно работать совместно.`
  },
  about: {
    about: 'О нас',
    whyUs: 'Почему мы?',
    audioCompanion: 'Универсальная',
    audioCompanionDescription:
      'В программе собрано все, что вам нужно, чтобы выучить язык. Мы знаем точно, сколько и когда вы должны выучить. Здесь вы никогда не будете отставать и ничего не пропустите.',
    chatWithTeacher: 'Слушайте и повторяйте',
    chatWithTeacherDescription:
      'Наша программа просто объясняет по-грузински, как говорить по-английски. Дружелюбный голос и развлекательное видео. Мы не учим правила наизусть. Мы их просто понимаем.',
    interactiveLessons: 'Интерактивные видео-уроки',
    interactiveLessonsDescription:
      'Интерактивное видео помогает вам проверять, насколько правильно вы восприняли материал, тренирует вас и исключает какое-либо недопонимание или ошибочное запоминание выученного',
    quality: 'Сэкономите время, энергию, нервы, деньги',
    qualityDescription:
      'Учите где хотите, когда хотите, и сколько хотите. Программа ваш  компаньон.  Вы можете ее перемотать, перескочить и повторять желаемую  фразу. После завершения первого курса, вы сможете общаться по-английски на начальном уровне в каждодневных ситуациях дома, на работе, на улице, в магазине, в поездках и т.д. И все это будет происходить в простом настоящем времени. Таким образом, вы уже студент первого курса, и хочу вам сказать, что весь курс состоит из 5 частей и содержит 44 урока.'
  },
  contact: {
    phone: 'Телефон',
    email: 'Эл-почта',
    address: 'Адрес'
  },
  faq: {
    faq: 'Часто задаваемые вопросы'
  },
  formPlaceholders: {
    name: 'Имя, фамилия:',
    email: 'Эл-почта:',
    msg: 'Послание:'
  },
  buttonNames: {
    send: 'Отправить',
    subscribe: 'Выписать'
  },
  profile: {
    personalInformation: 'Личные данные',
    teacherMessages: 'Послание учителя',
    courses: 'Мои курсы',
    noPurchasedCourses: 'У вас нет купленных курсов',
    paymentHistory: 'История оплат',
    signOut: 'Выход'
  },
  personalInfo: {
    profileAndSystemInformation: 'Профиль',
    passwordAndSecurity: 'Пароль и безопасность',
    passwordChangeText: 'Если не хотите изменить пароль, оставьте поле незаполненным',
    saveInformation: 'Сохранение информации',
    firstName: 'Имя',
    lastName: 'Фамилия',
    email: 'Эл-почта',
    phoneNumber: 'Номер телефона',
    oldPassword: 'Старый пароль',
    newPassword: 'Новый пароль',
    confirmPassword: 'повторить новый пароль'
  },
  teachersMessage: {
    title: 'Послание учителя'
  },
  courses: {
    coursesTitle: 'Мои уроки',
    SummaryTest: 'Сводный текст',
    ContinueLearning: 'Продолжение учебы',
    BuyAnotherCourse: 'Преобретение другой части курса'
  },
  paymentHistory: {
    sectionTitle: 'История оплат',
    product: 'Продукт',
    status: 'Статус',
    price: 'Цена',
    date: 'Число',
    complete: 'Завершенный',
    notPayed: 'Неоплаченный'
  },
  quiz: {
    skipQuestion: 'Пропустить вопросы',
    enterAnswer: 'Введите ответ',
    nextQuestion: 'Следующий вопрос',
    checkForUnderstanding: 'Проверка освоения материала',
    doYouWantToTakeQuiz: 'Хотите пройти тест?',
    skipQuiz: 'Пропустить тест',
    takeQuiz: 'Начать тест',
    showHint: 'Намек на правильный ответ',
    answerRequired: 'Ответ обязателен',
    yourAnswerIs: 'Ваш ответ {status}',
    hint: 'Намек',
    finishQuiz: 'Завершение теста',
    yourTestStats: 'Статистика теста',
    continue: 'Продолжение',
    playSound: 'Включение звука',
    stopSound: 'Остановка звука',
    updateTests: 'Обновить тесты',
    autoSkipIn: 'Автопропуск через'
  },
  quizStats: {
    correct: 'Правильный ответ',
    incorrect: 'Неправильный ответ',
    skipped: 'Пропущенный ответ',
    successRate: 'Указатель успеха'
  },
  auth: {
    forgotPassword: 'Забыли пароль?',
    rememberMe: 'Запомнить',
    noAccountYet: 'У вас нет аккаунта? ',
    alreadyHaveAccount: 'У вас есть аккаунт?',
    terms: 'Я ознакомился и согласен <a href="/terms" target="_blank"> Правила и условия</a>',
    loginWithGoogle: 'Авторизация с помощью Google',
    loginWithFacebook: 'Авторизация с помощью Facebook',
    resetPassword: 'Сбросить пароль',
    passwordChangeSuccessfully: 'Пароль успешно изменен',
    newPassword: 'Напишите новый пароль',
    inputLabelPassword: 'Новый пароль',
    confirmInputPassword: 'Подтвердите пароль',
    buttonResetPassword: 'Сброс пароля',
    outdatedCode: 'Код устарел'
  },
  validationErrors: {
    email: 'Неправильный формат Эл-почты',
    illegalCharacters: '{field} Содержит запрещенные символы',
    maxLength: 'Длина {field}-я  должна быть максимум {max} символов',
    minLength: 'Длина {field}-я должна быть минимум {min} символов',
    numeric: 'В {field}-е Должна быть цифра',
    required: '{field} Обязательно',
    sameAsPassword: 'Пароли не совпадают',
    terms: 'Вы должны согласиться с правилами и условиями сайта'
  },
  fields: {
    email: 'Эл-почта',
    password: 'Пароль',
    confirmPassword: 'Повторить пароль',
    firstName: 'Имя',
    lastName: 'Фамилия'
  },
  payments: {
    success: 'Оплата',
    successMessage: 'Вы успешно приобрели курс',
    goToCourse: 'Перейти на страницу курса',
    fail: 'Зафиксирована ошибка',
    failMessage: 'Оплата не произошла. Просьба, вновь попытаться или связаться с группой поддержки'
  },
  error: {
    title: 'Зафиксирована ошибка',
    submissionNotSaved: 'Не удалось сохранить данные. Свяжитесь с группой поддержки или пропустите вопрос',
    goToHomePage: 'вернуться на домашнюю страницу'
  },
  pageTitles: {
    generic: '{title} - NBR'
  },
  footer: {
    cookies: 'Кукизи',
    agreement: 'Соглашение',
    termsAndConditions: 'Правила и условия',
    privacyPolicy: 'Политика конфиденциальности',
    developedBy: 'Разработано BitCom Solution'
  }
};

export default messages;
